РасширениеГТС/Джитиис/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютнаяОтгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютныйСчетВРубли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпорту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочееПоступлениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзДругойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоЗаймамВыданным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПогашениеЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СнятиеНаличныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпортуТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыПоПлатежнойКарте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоДепозитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНеперечисленныхДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СборкаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазборкаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияЧерезКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиентуРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОформлениеГТДБрокером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОформлениеГТДСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНалогов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
//000017205+
&НаКлиенте
Процедура асп_ВалютаПриИзмененииПосле(Элемент)
	ВидимостьФлагаВалютнойОтгрузки();
КонецПроцедуры

&НаКлиенте
Процедура асп_ДоговорПриИзмененииПосле(Элемент)
	ВидимостьФлагаВалютнойОтгрузки();
КонецПроцедуры

&НаКлиенте
Процедура асп_СоглашениеПриИзмененииПосле(Элемент)
	ВидимостьФлагаВалютнойОтгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьФлагаВалютнойОтгрузки()
	ВидимостьРеквизитов = ЗначениеЗаполнено(Объект.Валюта) И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Код") <> "643";
	//Элементы.ВалютнаяОтгрузка.Видимость = ВидимостьРеквизитов;
	//Элементы.РекВалютныйСчетВРубли.Видимость = ВидимостьРеквизитов; 
	Элементы.ГруппаВалютнаяОтгрузка.Видимость = ВидимостьРеквизитов;
	Если НЕ ВидимостьРеквизитов Тогда
		Объект.ВалютнаяОтгрузка = Ложь;	
		Объект.ВалютныйСчетВРубли = "";
	КонецЕсли;
КонецПроцедуры // ВидимостьФлагаВалютнойОтгрузки()

&НаКлиенте
Процедура асп_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	ВидимостьРеквизитов = ЗначениеЗаполнено(Объект.Валюта) И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Код") <> "643";
	Если ВидимостьРеквизитов И НЕ ЗначениеЗаполнено(Объект.ВалютныйСчетВРубли) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Для валютного заказа, данное поле должно быть заполнено!";
		Сообщение.Поле = "Объект.ВалютныйСчетВРубли";
		Сообщение.Сообщить();	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура асп_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ВалютнаяОтгрузкаОформление();
	
КонецПроцедуры 

&НаСервере
Процедура ВалютнаяОтгрузкаОформление()
	
	НоваяГруппа = Элементы.Вставить("ГруппаВалютнаяОтгрузка", Тип("ГруппаФормы"), Элементы.ГруппаПараметрыПраво, Элементы.НалогообложениеНДС);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = ЛОЖЬ; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.Видимость = ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта.Код <> "643";
	
	НовыйЭлемент = Элементы.Добавить("РекВалютныйСчетВРубли", Тип("ПолеФормы"), Элементы.ГруппаВалютнаяОтгрузка);  
	НовыйЭлемент.ПутьКДанным = "Объект.ВалютныйСчетВРубли";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.Списоквыбора.Добавить("Да", "Да");  
	НовыйЭлемент.Списоквыбора.Добавить("Нет", "Нет");
	НовыйЭлемент.ПоложениеЗаголовка    	   = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок = "Валютный счет будет изменен в рубли"; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "РекВалютныйСчетВРублиПриИзменении");
	//НовыйЭлемент.Видимость = ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта.Код <> "643";
	
	НовыйЭлемент = Элементы.Добавить("Разделитель", Тип("ДекорацияФормы"),Элементы.ГруппаВалютнаяОтгрузка);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Ширина = 5; 
	
	НовыйЭлемент = Элементы.Добавить("ВалютнаяОтгрузка", Тип("ПолеФормы"), Элементы.ГруппаВалютнаяОтгрузка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.ПоложениеЗаголовка    	   = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Заголовок = "Валютная отгрузка";
	НовыйЭлемент.ПутьКДанным = "Объект.ВалютнаяОтгрузка";
	//НовыйЭлемент.Видимость = ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта.Код <> "643"; 
	НовыйЭлемент.Доступность = РольДоступна("ASP_ВалютнаяОтгрузка");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ВалютнаяОтгрузкаПриИзменении");	
	
КонецПроцедуры // ВалютнаяОтгрузкаОформление()


&НаКлиенте
Процедура РекВалютныйСчетВРублиПриИзменении(Элемент)
	
	
	
КонецПроцедуры // РекВалютныйСчетВРублиПриИзменении()

&НаКлиенте
Процедура ВалютнаяОтгрузкаПриИзменении(Элемент)
	Если Объект.ВалютнаяОтгрузка Тогда
		Объект.ВалютныйСчетВРубли = "Нет";	
	Иначе
		Объект.ВалютныйСчетВРубли = "Да";	
	КонецЕсли;	
КонецПроцедуры // РекВалютныйСчетВРублиПриИзменении()

&НаКлиенте
Процедура асп_ПриОткрытииПосле(Отказ) 
	Попытка
	Если НЕ (ЗначениеЗаполнено(Объект.Валюта) И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Код") <> "643") Тогда
		Объект.ВалютнаяОтгрузка = Ложь;	
		Объект.ВалютныйСчетВРубли = "";
	КонецЕсли;   
	Исключение
	КонецПопытки;
	
	//++ASP_Crow 19.02.2024 000021639 разграничение доступа к кнопкам 
	УстановитьДоступностьНеограниченногоСрокаРезерва();    
	//--ASP_Crow 19.02.2024 000021639
	
	//++ASP_ТрунькинБ 26.11.2024 000025342
	УстановитьДоступКИзменениюДокументаЗакПоставщику()
	//--ASP_ТрунькинБ 26.11.2024 000025342

	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьЭлементовПоОперацииСервер")
Процедура асп_УстановитьВидимостьЭлементовПоОперацииСервер()
	
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;
	
	Документы.ЗаказКлиента.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		Объект.ХозяйственнаяОперация,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	ДенежныеСредстваСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	ЭтоПередачаТоваров = (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
							Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);
							
	ЭтоПоставкаПодПринципала = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала;
	
	МассивЭлементов = Новый Массив();
	
	МассивЭлементов.Добавить("ДекорацияЭтапыОплаты");
	МассивЭлементов.Добавить("Расчеты");
	МассивЭлементов.Добавить("ДекорацияЗаголовокОплата");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Видимость", Не ЭтоПередачаТоваров);
	
	МассивЭлементов = Новый Массив();
	
	МассивЭлементов.Добавить("ТоварыРассчитатьСкидкиНаценки");
	МассивЭлементов.Добавить("ТоварыОтменитьРучныеСкидки");
	МассивЭлементов.Добавить("ТоварыНазначитьРучнуюСкидку");
	МассивЭлементов.Добавить("ТоварыНазначитьРучнуюСкидкуВыделенныхСтрок");
	МассивЭлементов.Добавить("ТоварыНазначитьАвтоматическиеСкидки");
	МассивЭлементов.Добавить("ТоварыОткрытьИнформациюОСкидках");
	МассивЭлементов.Добавить("КонтекстноеМенюТоварыОткрытьИнформациюОСкидках");
	МассивЭлементов.Добавить("СчитатьКартуЛояльности");
	МассивЭлементов.Добавить("СчитатьКартуЛояльностиКлиент");
	МассивЭлементов.Добавить("КартаЛояльности");
	МассивЭлементов.Добавить("СуммаСкидки");
	МассивЭлементов.Добавить("ДекорацияОтступТребуетсяЗалогЗаТару");
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Видимость", Не (ЭтоПередачаТоваров ИЛИ ЭтоПоставкаПодПринципала));

	Элементы.ЗачетОплатыФорма.Видимость = НЕ ЭтоПередачаТоваров И Элементы.ЗачетОплатыФорма.Видимость;
	Элементы.ТоварыЗаполнитьПодразделение.Видимость = Не ЭтоПоставкаПодПринципала;
	
	#Удаление
	НоменклатураСервер.УстановитьПараметрыВыбораНоменклатуры(Объект.ХозяйственнаяОперация, Элементы.ТоварыНоменклатура);
    #КонецУдаления
	#Вставка
	УстановитьПараметрыВыбораНоменклатуры(Объект.ХозяйственнаяОперация, Элементы.ТоварыНоменклатура);
	#КонецВставки
	
	УстановитьВидимостьПоляПартнер();
	
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость,
		Объект.Договор);
		
	Элементы.ВернутьМногооборотнуюТару.Доступность = (НЕ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала);
	Элементы.ГруппаТара.Видимость                  = НЕ ((Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию И КомиссионныеПродажи25)
														Или (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
															И Не Объект.ВернутьМногооборотнуюТару));
	Элементы.ГруппаТребуетсяЗалогЗаТару.Видимость  = НЕ ((Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию И КомиссионныеПродажи25)
														Или (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
															И Не Объект.ВернутьМногооборотнуюТару));
	
	УстановитьВидимостьКомандыЗаполненияВидаЦенПоДоговору();
	ЗаполнитьПараметрыСвязиВидаЦенИПризнакЦенаВключаетНДС();
	
КонецПроцедуры

////// СБП МОЧАЛИНА
&НаКлиенте
Процедура асп_СформироватьСсылкуСБПВместо(Команда)  
	ПереводыСБПc2bКлиент.ОткрытьФормуПлатежнойСсылкиСБП(Объект.Ссылка)
КонецПроцедуры 

&НаКлиенте
Процедура асп_ASP_КОбособленномуОбеспечениюПосле(Команда)
	
	ОбеспечениеУстановитьДействиеСВопросом("ДЕЙСТВИЕ_КОБЕСПЕЧЕНИЮ");
	
	ОбеспечениеУстановитьДействие("ФЛАГ_ОБОСОБЛЕННО");
	
КонецПроцедуры
//000017205-  

//ASP__A.Zhel 03.04.2019
&НаСервере
Процедура УстановитьДоступностьНеограниченногоСрокаРезерва()
	УстановитьПривилегированныйРежим(Истина);
	Элементы.НеограниченныйСрокХранения.ТолькоПросмотр = НЕ (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава"));
	Элементы.КонтрольРезерва.ТолькоПросмотр = НЕ (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава"));
	Элементы.ЗапретРезервирования.ТолькоПросмотр = НЕ (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава"));
	Элементы.РазрешениеРезервирования.ТолькоПросмотр = НЕ (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава"));
	Элементы.ПродлитьРезервДо.Видимость = (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава"));
	//Элементы.ПродлитьРезерв.Видимость = (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава"));
	Элементы.НомерЦикла.ТолькоПросмотр = НЕ (РольДоступна("ASP_УправлениеЦиклом") ИЛИ РольДоступна("ПолныеПрава"));
	Элементы.КомментарийКЦиклу.ТолькоПросмотр = НЕ (РольДоступна("ASP_УправлениеЦиклом") ИЛИ РольДоступна("ПолныеПрава")); 
	//ГТС запрет менять номенклатуру и количество по отправленным в производство(в цикл) 18.11.2019    //Отключено 01.10.2025 Включено 19.08.2026
	если Объект.НомерЦикла>0 и НЕ (РольДоступна("ASP_УправлениеЦиклом") ИЛИ РольДоступна("ПолныеПрава")) тогда
	Элементы.ТоварыОткрытьПодбор.Видимость = ложь;
	Элементы.ТоварыASP_ОткрытьПодборИзРасчетаНовый.Видимость=ложь;
	Элементы.ТоварыНоменклатура.ТолькоПросмотр = истина;
	Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = истина;
	Элементы.ТоварыКомментарий.ТолькоПросмотр=истина;  
	Элементы.КомментарийКЦиклу.ТолькоПросмотр=истина;
	конецесли;
	//ГТС запрет менять номенклатуру и количество по установленному контролю резерва 21.01.2021
	если Объект.НомерЦикла=0 И (Объект.КонтрольРезерва = истина или Объект.ЗапретРезервирования=Истина)и НЕ (РольДоступна("ASP_НеограниченныйСрокРезервирования") ИЛИ РольДоступна("ПолныеПрава")) тогда
	Элементы.ТоварыОткрытьПодбор.Видимость = ложь;
	Элементы.ТоварыASP_ОткрытьПодборИзРасчетаНовый.Видимость=ложь;
	Элементы.ТоварыНоменклатура.ТолькоПросмотр = истина;
	Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = истина;
	конецесли;

	//ГТС управление отгрузкой в долг
	Элементы.РазрешитьОтгрузку.ТолькоПросмотр=НЕ (РольДоступна("ASP_УправлениеЛимитомОтгрузкиИОтгрузкойВДолг") ИЛИ РольДоступна("ПолныеПрава"));
	
	//ГТС управление ценами ниже минимальных
	Элементы.РазрешенаЦенаНижеКолонки.ТолькоПросмотр=НЕ (РольДоступна("ASP_РазрешитьЦенуНижеКолонки") ИЛИ РольДоступна("ПолныеПрава"));
	//ГТС Управление отгрузкой без ЭДО
	Элементы.РазрешитьБезЭДО.ТолькоПросмотр=НЕ (РольДоступна("ASP_РазрешитьБезЭДО") ИЛИ РольДоступна("ПолныеПрава"));
	
	УстановитьПривилегированныйРежим(Ложь);
		
	
	
КонецПроцедуры
//__ASP

 &НаСервере
Процедура УстановитьДоступКИзменениюДокументаЗакПоставщику()
	Если ПравоДоступа("Изменение",Метаданные.Документы.ЗаказПоставщику) Тогда
		Элементы.ТоварыASP_РаспределитьПоЗаказамПоставщику.Видимость = Истина;
	Иначе	
		Элементы.ТоварыASP_РаспределитьПоЗаказамПоставщику.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура асп_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	ВзаиморасчетыСервер.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	#Вставка
	//ASP__A.Zhel 02.04.2019 
	Если Объект.Дата <> Объект.Ссылка.Дата Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДатаИзменилась", Истина);
	КонецЕсли;
	//__APS
	Если ПроверкаОтгрузитьОбособленно() Тогда
		Сообщить("В строках табличной части запрещено отгружать обособленно и резервировать к дате! Требуется перепроверить документы перемещения и оприходования для корректной отгрузки");
		Отказ = Истина;
	КонецЕсли;
    #КонецВставки
	Если ПроверкаИзмененияРезерва() Тогда
		сообщить("Ошибка, у вас изменены позиции с резервом: возможно изменилось количество или их состав. Обратитесь к менеджеру по продукту для снятия контроля резерва");
		Отказ = Истина;
	КонецЕсли;

	Если ПроверкаЦеновойКолонки(ПараметрыЗаписи) Тогда
		сообщить("В заказе найден товар, который продается ниже минимальной цены. Без согласования с отделом продукта такие цены устанавливать запрещено.");
		Отказ = Истина;
	КонецЕсли;

	Если ПроверкаСпособДоставки() Тогда
		Сообщить("Требуется указать способ доставки или заполнить заявку на транспорт");
		Отказ = Истина;
	КонецЕсли;

	Если ПроверкаАрхивнойПозиции() Тогда
		Сообщить("В заказе клиента найдена архивная позиция, такой заказ не рекомендуется продавать.");
	КонецЕсли; 
#Вставка
	//Если  ПроверкаГарантийногоТалона() Тогда 
	//	Сообщить("В заказе клиента есть позиция, по которой требуется оформление гарантийного талона.");
	//КонецЕсли; 
	Если  ПроверкаПриложенияФайла() Тогда
		//Сообщить("В заказе клиента есть позиция, по которой требуется приложить файл (чертеж).");
	КонецЕсли; 
	//ГТС                                                      
	//--ASP_Crow 11.03.2026 000029567 в расширение
	Если ПроверкаСкладскогоЗапаса() Тогда 
		Отказ = Истина;             
		Сообщить("Требуется согласовать отгрузку заказа с превышением 25% лимита отгрузки");
	КонецЕсли;

	Объект.СуммаОтменено     = ?(Объект.ТребуетсяЗалогЗаТару,
	Объект.Товары.Итог("СуммаСНДСОтменено"),
	Объект.Товары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));

	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;

	Отказ=ВыполнитьПроверкуПередЗаписьюГТС(Отказ, ТекущийОбъект);
	//ГТС Проверяем отгрузку

#КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура асп_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
	Истина, "Документ.ЗаказКлиента.Форма.ФормаДокумента.Событие.ОбработкаВыбора");

	Если ИсточникВыбора.ИмяФормы = "Обработка.СостояниеОбеспеченияЗаказов.Форма.Форма" Тогда

		АдресТаблицыДвижений = ЗаполнитьОбеспечениеИзФормыСостоянияОбеспечения(
		ВыбранноеЗначение.КодДействия,
		ВыбранноеЗначение.АдресАналитик,
		ВыбранноеЗначение.ПараметрыЗаполнения);

		// Возврат управления в форму обработки состояния обеспечения.
		ВыполнитьОбработкуОповещения(ВыбранноеЗначение.ВыполняемоеОповещение, АдресТаблицыДвижений);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ЗаказКлиента.Форма.РеквизитыПечати" Тогда

		Если ВыбранноеЗначение <> Неопределено Тогда
			Модифицированность = Истина;

			ЗаполнитьУстановитьРеквизитыДоставки = Объект.Грузополучатель <> ВыбранноеЗначение.Грузополучатель;

			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);

			Если ЗаполнитьУстановитьРеквизитыДоставки Тогда
				ЗаполнитьУстановитьРеквизитыДоставкиСервер("Грузополучатель");
			КонецЕсли;

		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда

		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();
		СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СтруктураПредприятия.Форма.ФормаВыбора" Тогда

		ПродажиКлиент.ОбработкаВыбораПодразделения(Объект.Товары, Элементы.Товары.ВыделенныеСтроки, ВыбранноеЗначение);

	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда

		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);

		ТоварыСерияПересчитатьЦены();

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия" Тогда

		СкорректироватьСтрокиЗаказа(ВыбранноеЗначение);
		
	#Вставка
	// Альтер ЛОГО+:	обрабатываем расчет стелажей
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.РасчетСтеллажейПодЕвроподдоны.Форма.Форма" Тогда
		
		ОбработкаВыбораСРасчетаНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.РасчетСтеллажейПодЕвроподдоныНовая.Форма.Форма" Тогда
		
		ОбработкаВыбораСРасчетаНаКлиенте(ВыбранноеЗначение);
	//ASP_Dante 31/08/19
		
	#КонецВставки
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ФизическиеЛица.Форма.ФормаСписка" Тогда


		Объект[ТекущийЭлемент.Имя] = ВыбранноеЗначение;

	КонецЕсли;
	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

КонецПроцедуры  

// Альтер ЛОГО+:	Выполняет необходимые действия при подборе с расчета стеллажей
&НаКлиенте
Процедура ОбработкаВыбораСРасчетаНаКлиенте(ВыбранноеЗначение)
	//++ASP_Crow 11.03.2026 000029567 в расширение
	
	ОбработкаВыбораСРасчетаНаСервере(ВыбранноеЗначение)
	
КонецПроцедуры

// Альтер ЛОГО+
&НаСервере
Процедура ОбработкаВыбораСРасчетаНаСервере(ВыбранноеЗначение)    
	//++ASP_Crow 11.03.2026 000029567 в расширение
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	ТабЧасть = Объект.Товары.Выгрузить();
	Для каждого СтрокаТоваров из ТаблицаТоваров цикл
		
		СтрокаТабЧасти = ТабЧасть.Найти(СтрокаТоваров.Номенклатура);
		НоваяСтрока = Ложь;
		Если СтрокаТабЧасти = неопределено тогда
			НоваяСтрока = Истина;
		ИначеЕсли СтрокаТабЧасти["Цена"]<>СтрокаТоваров.Цена тогда
			НоваяСтрока = Истина;
		КонецЕсли;
		//
		Если НоваяСтрока тогда
			СтрокаТабЧасти = ТабЧасть.Добавить();
			СтрокаТабЧасти["Номенклатура"] = СтрокаТоваров.Номенклатура;
			СтрокаТабЧасти["КоличествоУпаковок"] = СтрокаТоваров.Количество;
			СтрокаТабЧасти["Цена"] = СтрокаТоваров.Цена;
			СтрокаТабЧасти["Сумма"] = СтрокаТоваров.Сумма;
			СтрокаТабЧасти["СтавкаНДС"] = Справочники.СтавкиНДС.НайтиПоНаименованию("20%");//Перечисления.СтавкиНДС.НДС20;
			СтрокаТабЧасти["Склад"] = Объект.Склад;
		Иначе
			СтрокаТабЧасти["КоличествоУпаковок"] = СтрокаТабЧасти["КоличествоУпаковок"] + СтрокаТоваров.Количество;
			СтрокаТабЧасти["Сумма"] = СтрокаТабчасти["КоличествоУпаковок"]*СтрокаТабЧасти["Цена"];
		КонецЕсли;
		СтрокаТабЧасти["СуммаНДС"] = СтрокаТабЧасти["Сумма"]*(1-1/1.18);
	КонецЦикла;
	Объект.Товары.Загрузить(ТабЧасть);
	//
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
&После("ПриСозданииНаСервере")
Процедура КС_ПриСозданииНаСервереПосле(
	Отказ,
	СтандартнаяОбработка)

	КС_ДобавитьКомандыКОтгрузкеСкладом();

КонецПроцедуры

&НаСервере
Процедура КС_ДобавитьКомандыКОтгрузкеСкладом()

	КС_ДобавитьКомандуВМенюЗаполнить(
		"КС_ОтметитьВсеКОтгрузкеСкладом",
		"Отметить все к отгрузке складом",
		"ОтметитьВсеКОтгрузкеСкладом");

	КС_ДобавитьКомандуВМенюЗаполнить(
		"КС_СнятьВсеОтметкиКОтгрузкеСкладом",
		"Снять отметки к отгрузке складом",
		"СнятьВсеОтметкиКОтгрузкеСкладом");

	КС_ДобавитьКомандуВМенюЗаполнить(
		"КС_УстановитьВариантКОтгрузке",
		"Отгрузить отмеченное для склада",
		"УстановитьВариантОбеспеченияКОтгрузке");

КонецПроцедуры

&НаСервере
Процедура КС_ДобавитьКомандуВМенюЗаполнить(
	ИмяКоманды,
	ЗаголовокКоманды,
	ИмяОбработчика)

	// Создаем команду формы.
	НоваяКоманда = Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Заголовок = ЗаголовокКоманды;
	НоваяКоманда.Действие  = ИмяОбработчика;

	// Создаем кнопку внутри меню:
	// Товары -> командная панель -> Заполнить.
	ИмяКнопки = "Товары_" + ИмяКоманды;

	НоваяКнопка = Элементы.Добавить(
		ИмяКнопки,
		Тип("КнопкаФормы"),
		Элементы.ТоварыГруппаЗаполнить);

	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	НоваяКнопка.Заголовок  = ЗаголовокКоманды;
	НоваяКнопка.Отображение = ОтображениеКнопки.Текст;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеКОтгрузкеСкладом(Команда)

	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.КОтгрузкеСкладом = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметкиКОтгрузкеСкладом(Команда)

	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.КОтгрузкеСкладом = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВариантОбеспеченияКОтгрузке(Команда)

	ИдентификаторыСтрок = Новый Массив;

	Для Каждого СтрокаТоваров Из Объект.Товары Цикл

		Если СтрокаТоваров.КОтгрузкеСкладом Тогда
			ИдентификаторыСтрок.Добавить(
				СтрокаТоваров.ПолучитьИдентификатор());
		КонецЕсли;

	КонецЦикла;

	Если ИдентификаторыСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(
			,
			"Не отмечены товары для установки варианта обеспечения.");
		Возврат;
	КонецЕсли;

	Результат = КС_УстановитьОтгрузкуДляОтмеченныхСтрок(
		ИдентификаторыСтрок);

	// Повторяем стандартную обработку вопросов обеспечения.
	ВопросЗадан =
		ОбеспечениеВДокументахКлиент.
			ПоказатьВопросЗаполнятьОбеспечениеЦелымиУпаковками(
				ЭтотОбъект,
				Объект.Товары,
				Результат,
				"ПослеВопросаЗаполнятьОбеспечениеЦелымиУпаковками");

	Если Не ВопросЗадан Тогда

		ОбеспечениеВДокументахКлиент.
			ПоказатьВопросСнятьФлагОтгружатьОднойДатой(
				ЭтотОбъект,
				Объект.Товары,
				Результат,
				"ПослеВопросаСнятьФлагОтгружатьОднойДатой");

	КонецЕсли;

КонецПроцедуры     

&НаСервере
Функция КС_УстановитьОтгрузкуДляОтмеченныхСтрок(
	ИдентификаторыСтрок)

	Результат =
		ОбеспечениеВДокументахСервер.
			ОбеспечениеУстановитьДействиеСтруктураРезультата();

	Изменения =
		ОбеспечениеВДокументахСервер.УстановитьДействие(
			"ДЕЙСТВИЕ_ОТГРУЗИТЬ",
			ЭтотОбъект,
			ИдентификаторыСтрок);

	ЗаполнитьЗначенияСвойств(Результат, Изменения);

	Если Изменения.ТаблицаИзменений <> Неопределено Тогда

		ПослеЗаполненияОбеспечения(
			Изменения.ТаблицаИзменений,
			ОбеспечениеВДокументахКлиентСервер.
				РежимВыборДействия(),
			Результат);

	КонецЕсли;

	Возврат Результат;

КонецФункции
